### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create

Terraform will perform the following actions:

  # module.dev-host-prjs["svc1"].module.ngfw_enterprise[0].google_network_security_firewall_endpoint_association.fw_endp_association_primary will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_endp_association_primary" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-central1-a/firewallEndpoints/fwe-chspoc-dev-host-svc1-us-central1-a"
      + id                = (known after apply)
      + location          = "us-central1-a"
      + name              = "fwe-chspoc-dev-host-svc1-us-central1-a-asc"
      + network           = "projects/chspoc-dev-host-svc1/global/networks/vpc-dev-svc1"
      + parent            = "projects/chspoc-dev-host-svc1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "universe" but a value was

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "service_accounts" but a

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 6 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `success`

*Pusher: @leorocca-gg, Action: `pull_request`, Working Directory: ``, Workflow: `FAST networking stage`*